{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend files and assets.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables and theme tokens for light and dark modes.",
  "frontend/index.html": "HTML entry point setting base href and mounting the React app.",
  "frontend/public/.well-known/ic-domains": "Domain verification file listing the allowed icp0.io domain.",
  "frontend/SMOKE_TEST_PRODUCTION.md": "Production smoke‑test checklist covering routing, asset loading, diagnostics, and IC deployment behavior.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and normalizes BASE_URL for IC‑compatible routing.",
  "frontend/src/components/DebugImagesPanel.tsx": "Empty placeholder file for debugging image rendering.",
  "frontend/src/components/FaujiIcon.tsx": "Renders cropped sections of the icon sprite to display shield, flag, handshake, or rupee icons.",
  "frontend/src/components/GalleryLightbox.tsx": "Empty placeholder for the gallery lightbox component.",
  "frontend/src/components/ImageWithFallback.tsx": "Image component that shows a styled fallback when loading fails and resets error state on src change.",
  "frontend/src/components/ProductionDiagnostics.tsx": "Debug panel showing BASE_URL and resolved core asset URLs for production troubleshooting.",
  "frontend/src/components/SectionHeading.tsx": "Reusable section header with optional subtitle and description supporting alignment and custom styling.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with branding, quick links, contact details, and a credits bar.",
  "frontend/src/components/SiteHeader.tsx": "Provides a responsive header with logo, navigation links, and a mobile menu drawer.",
  "frontend/src/components/SiteLayout.tsx": "Defines the main page layout including header, footer, content outlet, sticky contact bar, and optional diagnostics.",
  "frontend/src/components/StickyContactBar.tsx": "Displays a mobile-only bottom bar with quick call and WhatsApp buttons.",
  "frontend/src/content/faujiFinanceContent.ts": "Exports static content for hero, about, team, representatives, services, why-choose points, and contact info.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for Internet Identity login, logout, identity management, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are needed.",
  "frontend/src/index.css": "Defines Tailwind layers and custom Fauji Finance color system with light/dark theme variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/ContactPage.tsx": "Renders a styled contact page with hero text, call/WhatsApp CTAs, and team contact sections using CONTACT and REPRESENTATIVES data.",
  "frontend/src/pages/GalleryPage.tsx": "Empty placeholder file for a gallery page with no implemented content.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with hero, about, services highlights, contact CTAs, and Google Maps integration using content constants.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a services hero, services grid sourced from SERVICES data, and supplemental documents and process steps.",
  "frontend/src/pages/TeamPage.tsx": "Empty placeholder file for a team page with no implemented content.",
  "frontend/src/utils/debugImages.ts": "Empty utility file intended for image debugging hooks but currently contains no logic.",
  "frontend/src/utils/googleMaps.ts": "Provides utility functions to generate Google Maps search and embed URLs from an address.",
  "frontend/src/utils/publicAssetUrl.ts": "Builds normalized asset URLs using BASE_URL, handling absolute URLs and removing double slashes.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, Fauji color palette, fonts, animations, and plugins.",
  "project_state.json": "Tracks project state, design notes, issues, and feature requirements for the Fauji Finance website."
}